<div style="text-align: center;">
    <h1>Fetch the data</h1>
</div>

In [18]:
#Import libraries
import sqlite3
import pandas as pd

In [19]:
# Connect to the SQLite database
db_path = 'dialects_database.db'
conn = sqlite3.connect(db_path)

In [20]:
# Get the table names
table_query = "SELECT name FROM sqlite_master WHERE type='table';"
tables = pd.read_sql(table_query, conn)

In [31]:
tables

         name
0     id_text
1  id_dialect

In [22]:
# Inspect the id_text table
id_text_query = "SELECT * FROM id_text LIMIT 5;"
id_text_sample = pd.read_sql(id_text_query, conn)

In [23]:
id_text_sample

                    id                                               text
0  1009754958479151232  @toha_Altomy @gy_yah قليلين ادب ومنافقين. لو ا...
1  1009794751548313600  @AlmFaisal 😂😂 الليبيين متقلبين!!!\nبس بالنسبة ...
2  1019989115490787200  @smsm071990 @ALMOGRBE كل 20 تانيه شاب ليبي بير...
3  1035479791758135168  @AboryPro @lyranoo85 رانيا عقليتك متخلفة. اولا...
4  1035481122921164800  @lyranoo85 شكلك متعقدة علشان الراجل لي تحبيه ا...

In [24]:
# Inspect the id_dialect table
id_dialect_query = "SELECT * FROM id_dialect LIMIT 5;"
id_dialect_sample = pd.read_sql(id_dialect_query, conn)

In [25]:
id_dialect_sample

                    id dialect
0  1009754958479151232      LY
1  1009794751548313600      LY
2  1019989115490787200      LY
3  1035479791758135168      LY
4  1035481122921164800      LY

In [26]:
# Join the tables on the id column and fetch the data
fetch_data_query = """
SELECT id_text.id, id_text.text, id_dialect.dialect
FROM id_text
JOIN id_dialect ON id_text.id = id_dialect.id;
"""
data = pd.read_sql(fetch_data_query, conn)

In [27]:
# Display the first few rows of the combined data
data.head()

,id,text,dialect
0,1009754958479151232,@toha_Altomy @gy_yah قليلين ادب ومنافقين. لو ا...,LY
1,1009794751548313600,@AlmFaisal 😂😂 الليبيين متقلبين!!!\nبس بالنسبة ...,LY
2,1019989115490787200,@smsm071990 @ALMOGRBE كل 20 تانيه شاب ليبي بير...,LY
3,1035479791758135168,@AboryPro @lyranoo85 رانيا عقليتك متخلفة. اولا...,LY
4,1035481122921164800,@lyranoo85 شكلك متعقدة علشان الراجل لي تحبيه ا...,LY

In [28]:
# Save the data to a CSV file
data.to_csv('dialects_data.csv', index=False)